starliliko/diy-drone-powered-by-esp32s3/components/core/crazyflie/hal/src/sensors_bmi088_spi_ms5611.c
#define DEBUG_MODULE "IMU" // IMU模块

#include <math.h>

#include "sensors_bmi088_spi_ms5611.h"
#include "debug_cf.h"
#include "esp_log.h"

#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"

#include "system.h"
#include "configblock.h"
#include "param.h"
#include "log.h"
#include "imu.h"
#include "nvicconf.h"
#include "ledseq.h"
#include "sound.h"
#include "filter.h"
#include "config.h"
#include "i2cdev.h"
#include "ms5611.h"
#include "static_mem.h"
#include "bmi088_spi.h"
#include "bmi088_config.h"
#include "bmi088.h"
#include "estimator_kalman.h" // 用于获取quadIsFlying状态

#define GYRO_ADD_RAW_AND_VARIANCE_LOG_VALUES // 启用陀螺仪原始值和方差日志记录
#define GYRO_DYNAMIC_CALIBRATION_ENABLED 1   // 启用陀螺仪动态校准

#define SENSORS_READ_RATE_HZ 1000 // 传感器读取频率 (1kHz控制循环)
/*
通过硬件中断同步，已经实现IMU数据对齐与时间同步
*/

#define SENSORS_STARTUP_TIME_MS 2000                                     // 传感器启动时间
#define SENSORS_READ_BARO_HZ 50                                          // 气压计读取频率
#define SENSORS_DELAY_BARO (SENSORS_READ_RATE_HZ / SENSORS_READ_BARO_HZ) // 气压计读取延迟

#define SENSORS_BMI088_GYRO_FS_CFG BMI088_CONFIG_GYRO_RANGE
#define SENSORS_BMI088_GYRO_RANGE_DPS 2000.0f                                              // 陀螺仪量程（度每秒）
#define SENSORS_BMI088_DEG_PER_LSB_CFG ((2.0f * SENSORS_BMI088_GYRO_RANGE_DPS) / 65536.0f) // 每LSB对应的度数

#define SENSORS_BMI088_ACCEL_FS_CFG BMI088_CONFIG_ACC_RANGE // 加速度计量程配置
#define SENSORS_BMI088_ACCEL_G 6.0f
#define SENSORS_BMI088_G_PER_LSB_CFG ((2.0f * SENSORS_BMI088_ACCEL_G) / 65536.0f) // 每LSB对应的重力加速度
#define SENSORS_BMI088_1G_IN_LSB (65536.0f / (2.0f * SENSORS_BMI088_ACCEL_G))     // 1G对应的LSB值

#define GYRO_NBR_OF_AXES 3                        // 陀螺仪轴数
#define GYRO_MIN_BIAS_TIMEOUT_MS M2T(2 * 1000)    // 陀螺仪最小偏置超时时间
#define GYRO_DYNAMIC_CALIB_DELAY_MS M2T(2 * 1000) // 动态校准延迟时间（着陆后2秒开始）
#define GYRO_DYNAMIC_CALIB_ALPHA 0.002f           // 动态校准低通滤波系数（time constant ~1s）
#define SENSORS_NBR_OF_BIAS_SAMPLES 1024          // 偏置样本数量

// BMI088噪声差异：
//   - BMI088噪声密度: 0.014 °/s/√Hz, 带宽116Hz, 灵敏度32.8 LSB/°/s → ~5 LSB RMS
//   - MPU6050噪声密度: 0.005 °/s/√Hz, 带宽42Hz,  灵敏度16.4 LSB/°/s → ~0.5 LSB RMS
// 实测静止时方差: X~50, Y~70, Z~50 (已归一化)
#define GYRO_VARIANCE_BASE 3000                        // 方差阈值（适配BMI088噪声特性）
#define GYRO_VARIANCE_THRESHOLD_X (GYRO_VARIANCE_BASE) // 陀螺仪方差阈值X
#define GYRO_VARIANCE_THRESHOLD_Y (GYRO_VARIANCE_BASE) // 陀螺仪方差阈值Y
#define GYRO_VARIANCE_THRESHOLD_Z (GYRO_VARIANCE_BASE) // 陀螺仪方差阈值Z

#define SENSORS_ACC_SCALE_SAMPLES 200 // 加速度计比例样本数量

// 参数适合平稳飞行
#define GYRO_LPF_CUTOFF_FREQ 30  // 陀螺仪低通滤波器截止频率 (降低: 80→30Hz 减少噪声带宽)
#define ACCEL_LPF_CUTOFF_FREQ 20 // 加速度计低通滤波器截止频率

#define ESP_INTR_FLAG_DEFAULT 0 // 默认中断优先级

typedef struct
{
    Axis3f bias;                                  // 偏置值
    Axis3f variance;                              // 方差值
    Axis3f mean;                                  // 均值
    bool isBiasValueFound;                        // 是否找到零飘值
    bool isBufferFilled;                          // 缓冲区是否已填满
    Axis3i16 *bufHead;                            // 缓冲区头指针
    Axis3i16 buffer[SENSORS_NBR_OF_BIAS_SAMPLES]; // 数据缓冲区
} BiasObj;

// 静态内存分配队列
static QueueHandle_t accelerometerDataQueue;
STATIC_MEM_QUEUE_ALLOC(accelerometerDataQueue, 1, sizeof(Axis3f));
static QueueHandle_t gyroDataQueue;
STATIC_MEM_QUEUE_ALLOC(gyroDataQueue, 1, sizeof(Axis3f));
static QueueHandle_t magnetometerDataQueue;
STATIC_MEM_QUEUE_ALLOC(magnetometerDataQueue, 1, sizeof(Axis3f));
static QueueHandle_t barometerDataQueue;
STATIC_MEM_QUEUE_ALLOC(barometerDataQueue, 1, sizeof(baro_t));

// 静态内存分配信号量
static SemaphoreHandle_t sensorsDataReady;       // 传感器数据就绪
static StaticSemaphore_t sensorsDataReadyBuffer; // 分配缓冲区
static SemaphoreHandle_t dataReady;              // 数据处理就绪
static StaticSemaphore_t dataReadyBuffer;        // 分配缓冲区

static bool isInit = false; // 初始化标志
/*
    传感器数据结构体，包含陀螺仪、加速度计、磁力计和气压计的数据
*/
static sensorData_t sensorData;

static volatile uint64_t imuIntTimestamp; // IMU中断时间戳

static Axis3i16 gyroRaw;  // 原始陀螺仪数据
static Axis3i16 accelRaw; // 原始加速度计数据

NO_DMA_CCM_SAFE_ZERO_INIT static BiasObj gyroBiasRunning; // 陀螺仪零漂校准对象 //不会被DMA访问
static Axis3f gyroBias;                                   // 陀螺仪零偏值
static bool gyroBiasFound = false;                        // 完成陀螺仪零偏校准

#ifdef GYRO_DYNAMIC_CALIBRATION_ENABLED
static uint32_t landedTime = 0;                                // 着陆时间戳
static bool isLanded = false;                                  // 着陆状态标志
static float gyroDynamicCalibAlpha = GYRO_DYNAMIC_CALIB_ALPHA; // 动态校准滤波系数（可调参数）
static uint8_t gyroDynamicCalibEnabled = 1;                    // 动态校准使能开关
#endif

static float accScaleSum = 0;         // 加速度计模长累加和
static float accScale = 1;            // 加速度计比例因子（缩放系数） //按实际调整
static bool accScaleFound = false;    // 是否找到加速度计比例因子
static uint32_t accScaleSumCount = 0; // 加速度计比例因子累加计数

// 二阶低通滤波器
static lpf2pData accLpf[3];  // 加速度计低通滤波器数据
static lpf2pData gyroLpf[3]; // 陀螺仪低通滤波器数据

static bool isBarometerPresent = false;               // 气压计存在标志
static uint8_t baroMeasDelayMin = SENSORS_DELAY_BARO; // 气压计最小测量延迟

// 数据就绪标志
static volatile bool bmi088AccDataReady = false;
static volatile bool bmi088GyroDataReady = false;

// 中断计数器（用于调试）
static volatile uint32_t accIntCount = 0;
static volatile uint32_t gyroIntCount = 0;

// IMU安装角度
static float cosPitch;
static float sinPitch;
static float cosRoll;
static float sinRoll;
#define PITCH_CALIB (CONFIG_PITCH_CALIB * 1.0 / 100) // 俯仰校准角度 单位1度
#define ROLL_CALIB (CONFIG_ROLL_CALIB * 1.0 / 100)

// 气压计跳过开关：设为1则跳过气压计检查（可通过地面站修改）
static uint8_t skipBaroCheck = 0;
// CONFIG_PITCH_CALIB  单位0.01度

static bool processGyroBias(int16_t gx, int16_t gy, int16_t gz, Axis3f *gyroBiasOut);
static bool processAccScale(int16_t ax, int16_t ay, int16_t az);
#ifdef GYRO_DYNAMIC_CALIBRATION_ENABLED
static void gyroDynamicCalibUpdate(int16_t gx, int16_t gy, int16_t gz, bool quadIsFlying);
#endif
static void sensorsBiasObjInit(BiasObj *bias);
static void sensorsCalculateVarianceAndMean(BiasObj *bias, Axis3f *varOut, Axis3f *meanOut);
static void sensorsAddBiasValue(BiasObj *bias, int16_t x, int16_t y, int16_t z);
static bool sensorsFindBiasValue(BiasObj *bias);
static void sensorsAccAlignToGravity(Axis3f *in, Axis3f *out);
static void applyAxis3fLpf(lpf2pData *data, Axis3f *in);
static void sensorsDeviceInit(void);
static void sensorsInterruptInit(void);
static void sensorsScaleBaro(baro_t *baroScaled);

STATIC_MEM_TASK_ALLOC(sensorsTask, SENSORS_TASK_STACKSIZE); // 静态内存分配任务

bool sensorsBmi088SpiMs5611ReadGyro(Axis3f *gyro)
{
    return (pdTRUE == xQueueReceive(gyroDataQueue, gyro, 0));
}

bool sensorsBmi088SpiMs5611ReadAcc(Axis3f *acc)
{
    return (pdTRUE == xQueueReceive(accelerometerDataQueue, acc, 0));
}

bool sensorsBmi088SpiMs5611ReadMag(Axis3f *mag)
{
    return (pdTRUE == xQueueReceive(magnetometerDataQueue, mag, 0));
}

bool sensorsBmi088SpiMs5611ReadBaro(baro_t *baro)
{
    return (pdTRUE == xQueueReceive(barometerDataQueue, baro, 0));
}
/* 传感器数据获取函数
   从各个传感器读取数据并存储到传感器数据结构体中
*/
// 底层仍然是调用xQueueReceive
void sensorsBmi088SpiMs5611Acquire(sensorData_t *sensors, const uint32_t tick)
{
    sensorsReadGyro(&sensors->gyro);
    sensorsReadAcc(&sensors->acc);
    sensorsReadMag(&sensors->mag);
    sensorsReadBaro(&sensors->baro);
    sensors->interruptTimestamp = sensorData.interruptTimestamp;
}

