starliliko/diy-drone-powered-by-esp32s3/components/core/crazyflie/hal/src/sensors_bmi088_spi_ms5611.c
bool sensorsBmi088SpiMs5611AreCalibrated(void) // 传感器校准状态检查函数
{
    return gyroBiasFound;
}

static void sensorsTask(void *param)
{
    systemWaitStart();

    vTaskDelay(M2T(200)); // 200ms等待系统稳定

    // sensorsDeviceInit(); // 传感器设备初始化

    Axis3f accScaled;

    uint32_t interruptCount = 0;
    while (1)
    {
        if (pdTRUE == xSemaphoreTake(sensorsDataReady, M2T(1000))) // 1秒超时
        {
            interruptCount++;
            sensorData.interruptTimestamp = imuIntTimestamp;

            // ========================================
            // FIX: Check data-ready flags to prevent double-processing
            // ========================================
            // ACC INT and GYRO INT both give the SAME binary semaphore.
            // Without flag check, EVERY wakeup reads+processes BOTH sensors,
            // causing the gyro LPF to process each raw sample TWICE.
            // This distorts the biquad filter state, effectively doubling
            // the noise bandwidth (80Hz designed → ~160Hz actual).
            bool newGyro = bmi088GyroDataReady;
            bool newAccel = bmi088AccDataReady;

            // Read SPI only for sensors with new data
            int16_t raw_gx, raw_gy, raw_gz;
            int16_t raw_ax, raw_ay, raw_az;
            if (newGyro) {
                bmi088GyroDataReady = false;
                bmi088_get_gyro_data(&raw_gx, &raw_gy, &raw_gz);
                gyroRaw.x = raw_gx;
                gyroRaw.y = raw_gy;
                gyroRaw.z = raw_gz;
            }
            if (newAccel) {
                bmi088AccDataReady = false;
                bmi088_get_accel_data(&raw_ax, &raw_ay, &raw_az);
                accelRaw.x = raw_ax;
                accelRaw.y = raw_ay;
                accelRaw.z = raw_az;
            }

            // Re-enable interrupts after SPI read complete
            gpio_intr_enable(BMI088_INT1_PIN);
            gpio_intr_enable(BMI088_INT3_PIN);

            // Process gyro data (only when fresh sample available)
            if (newGyro) {
                gyroBiasFound = processGyroBias(gyroRaw.x, gyroRaw.y, gyroRaw.z, &gyroBias);
                if (gyroBiasFound) {
                    gyroDynamicCalibUpdate(gyroRaw.x, gyroRaw.y, gyroRaw.z, quadIsFlying);
                }

                sensorData.gyro.x = -(gyroRaw.y - gyroBias.y) * SENSORS_BMI088_DEG_PER_LSB_CFG;
                sensorData.gyro.y = (gyroRaw.x - gyroBias.x) * SENSORS_BMI088_DEG_PER_LSB_CFG;
                sensorData.gyro.z = -(gyroRaw.z - gyroBias.z) * SENSORS_BMI088_DEG_PER_LSB_CFG;
                applyAxis3fLpf((lpf2pData *)(&gyroLpf), &sensorData.gyro);
            }

            // Process accel data (only when fresh sample available)
            if (newAccel) {
                if (gyroBiasFound) {
                    processAccScale(accelRaw.x, accelRaw.y, accelRaw.z);
                }
                accScaled.x = -accelRaw.y * SENSORS_BMI088_G_PER_LSB_CFG / accScale;
                accScaled.y = accelRaw.x * SENSORS_BMI088_G_PER_LSB_CFG / accScale;
                accScaled.z = accelRaw.z * SENSORS_BMI088_G_PER_LSB_CFG / accScale;
                sensorsAccAlignToGravity(&accScaled, &sensorData.acc);
                applyAxis3fLpf((lpf2pData *)(&accLpf), &sensorData.acc);
            }
        }

        // 读取气压计数据
        if (isBarometerPresent)
        {
            static uint8_t baroMeasDelay = SENSORS_DELAY_BARO;
            if (--baroMeasDelay == 0)
            {
                sensorsScaleBaro(&sensorData.baro);
                baroMeasDelay = baroMeasDelayMin;

                // 输出气压计数据（每秒一次，50Hz读取 = 每20次输出一次）
                // static uint8_t baroLogCount = 0;
                // if (++baroLogCount >= 50)
                // {
                //     printf("%.2f, %.2f, %.2f \n",
                //            sensorData.baro.pressure, sensorData.baro.temperature, sensorData.baro.asl);
                //     baroLogCount = 0;
                // }
            }
        }

        xQueueOverwrite(accelerometerDataQueue, &sensorData.acc);
        xQueueOverwrite(gyroDataQueue, &sensorData.gyro);
        if (isBarometerPresent)
        {
            xQueueOverwrite(barometerDataQueue, &sensorData.baro);
        }

        xSemaphoreGive(dataReady);
    }
}

void sensorsBmi088SpiMs5611WaitDataReady(void)
{
    xSemaphoreTake(dataReady, portMAX_DELAY);
}

static void sensorsDeviceInit(void)
{
    if (isInit)
        return;

    spiDrvInit(SPI_DRV_HOST_DEFAULT); // 初始化SPI
    i2cdevInit(I2C0_DEV);             // 初始化I2C

    // 等待传感器启动
    vTaskDelay(M2T(SENSORS_STARTUP_TIME_MS)); // 2秒

    // 初始化BMI088 (SPI)
    if (!bmi088_init())
    {
        DEBUG_PRINTI("BMI088 SPI init [FAIL]\n");
        isInit = false;
        return;
    }
    else
    {
        DEBUG_PRINTI("BMI088 SPI init [OK]\n");
    }

    // 初始化MS5611 (I2C) - 可通过 skipBaroCheck 参数跳过检查
    if (ms5611Init(I2C0_DEV))
    {
        isBarometerPresent = true;
        DEBUG_PRINTI("MS5611 I2C init [OK]\n");
        baroMeasDelayMin = SENSORS_DELAY_BARO;
    }
    else
    {
        isBarometerPresent = false;
        DEBUG_PRINTI("MS5611 I2C init [FAIL]\n");
        if (!skipBaroCheck)
        {
            DEBUG_PRINTI("Barometer required! Set imu_sensors.skipBaro=1 to bypass\n");
            isInit = false;
            return;
        }
        DEBUG_PRINTI("skipBaroCheck=1, continuing without barometer\n");
    }

    // 初始化低通滤波器
    for (uint8_t i = 0; i < 3; i++)
    {
        lpf2pInit(&gyroLpf[i], 1000, GYRO_LPF_CUTOFF_FREQ);
        lpf2pInit(&accLpf[i], 1000, ACCEL_LPF_CUTOFF_FREQ);
    }

    // cosPitch = cosf(configblockGetCalibPitch() * (float)M_PI / 180);
    // sinPitch = sinf(configblockGetCalibPitch() * (float)M_PI / 180);
    // cosRoll = cosf(configblockGetCalibRoll() * (float)M_PI / 180);
    // sinRoll = sinf(configblockGetCalibRoll() * (float)M_PI / 180);
    cosPitch = cosf(PITCH_CALIB * (float)M_PI / 180);
    sinPitch = sinf(PITCH_CALIB * (float)M_PI / 180);
    cosRoll = cosf(ROLL_CALIB * (float)M_PI / 180);
    sinRoll = sinf(ROLL_CALIB * (float)M_PI / 180);
    DEBUG_PRINTI("pitch_calib = %f,roll_calib = %f", PITCH_CALIB, ROLL_CALIB);

    isInit = true;
}

static void sensorsTaskInit(void)
{
    accelerometerDataQueue = STATIC_MEM_QUEUE_CREATE(accelerometerDataQueue);
    gyroDataQueue = STATIC_MEM_QUEUE_CREATE(gyroDataQueue);
    magnetometerDataQueue = STATIC_MEM_QUEUE_CREATE(magnetometerDataQueue);
    barometerDataQueue = STATIC_MEM_QUEUE_CREATE(barometerDataQueue);

    STATIC_MEM_TASK_CREATE(sensorsTask, sensorsTask, SENSORS_TASK_NAME, NULL, SENSORS_TASK_PRI);
}

void sensorsBmi088SpiMs5611Init(void)
{
    if (isInit)
    {
        return;
    }

